In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("StudentsPerformance.csv")

In [3]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [4]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [6]:
df = df.drop(columns = ['race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course'])

In [7]:
df.head()

   gender  math score  reading score  writing score
0  female          72             72             74
1  female          69             90             88
2  female          90             95             93
3    male          47             57             44
4    male          76             78             75

In [8]:
pd.cut(df['math score'], bins = 4)

0       (50.0, 75.0]
1       (50.0, 75.0]
2      (75.0, 100.0]
3       (25.0, 50.0]
4      (75.0, 100.0]
           ...
995    (75.0, 100.0]
996     (50.0, 75.0]
997     (50.0, 75.0]
998     (50.0, 75.0]
999    (75.0, 100.0]
Name: math score, Length: 1000, dtype: category
Categories (4, interval[float64]): [(-0.1, 25.0] < (25.0, 50.0] < (50.0, 75.0] < (75.0, 100.0]]

In [9]:
pd.cut(df['math score'], bins = 4).value_counts()

(50.0, 75.0]     576
(75.0, 100.0]    274
(25.0, 50.0]     143
(-0.1, 25.0]       7
Name: math score, dtype: int64

In [12]:
grades = ['C', 'B-', 'B', 'A,', 'A-']
cut_bins = [0, 40, 55, 65, 85, 100]

In [14]:
df['Notas'] = pd.cut(df['math score'], bins = cut_bins, labels = grades)

In [15]:
df.head()

   gender  math score  reading score  writing score Notas
0  female          72             72             74    A,
1  female          69             90             88    A,
2  female          90             95             93    A-
3    male          47             57             44    B-
4    male          76             78             75    A,

In [16]:
pd.qcut(df['math score'], q = 4)

0        (66.0, 77.0]
1        (66.0, 77.0]
2       (77.0, 100.0]
3      (-0.001, 57.0]
4        (66.0, 77.0]
            ...
995     (77.0, 100.0]
996      (57.0, 66.0]
997      (57.0, 66.0]
998      (66.0, 77.0]
999      (66.0, 77.0]
Name: math score, Length: 1000, dtype: category
Categories (4, interval[float64]): [(-0.001, 57.0] < (57.0, 66.0] < (66.0, 77.0] < (77.0, 100.0]]

In [17]:
pd.qcut(df['math score'], q = 4).value_counts()

(-0.001, 57.0]    266
(66.0, 77.0]      264
(57.0, 66.0]      241
(77.0, 100.0]     229
Name: math score, dtype: int64

In [18]:
df['math score'].describe()

count    1000.00000
mean       66.08900
std        15.16308
min         0.00000
25%        57.00000
50%        66.00000
75%        77.00000
max       100.00000
Name: math score, dtype: float64

In [19]:
pd.qcut(df['math score'], q = 6).value_counts()

(-0.001, 52.0]    179
(66.0, 73.0]      173
(60.0, 66.0]      168
(73.0, 81.0]      166
(52.0, 60.0]      160
(81.0, 100.0]     154
Name: math score, dtype: int64

In [28]:
df['math_perc'] = pd.qcut(df['math score'], q = [0, .40, .55, .65, .85, .1], labels = False)

In [29]:
df.head()

   gender  math score  reading score  writing score Notas  math_perc
0  female          72             72             74    A,        2.0
1  female          69             90             88    A,        2.0
2  female          90             95             93    A-        NaN
3    male          47             57             44    B-        0.0
4    male          76             78             75    A,        NaN

In [39]:
results, bin_edges = pd.qcut(df['math score'], q = [0, .40, .55, .65, .85, .1], labels = False, retbins = True)

In [40]:
results

0      2.0
1      2.0
2      NaN
3      0.0
4      NaN
      ...
995    NaN
996    0.0
997    0.0
998    1.0
999    3.0
Name: math score, Length: 1000, dtype: float64